app/views/issues/_form.html.haml

    .controls
      = f.collection_select :department_id, Department.all, :id, :name, :prompt => true
  .control-group
---
SELECT "departments".* FROM "departments"