app/views/issues/show.html.haml

  %h1= "Issue: #{@issue.ref}"
  %h4= "Assigned to #{@issue.user.email}" if @issue.user.present?
---
SELECT "users".* FROM "users"