app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."ref" = 'TST-818847' LIMIT 1
SELECT "users".* FROM "users"
---
  def show
    @issue = Issue.find_by_ref(params[:id])
    @users = User.all

INSERT INTO "issues" ("body", "created_at", "department_id", "email", "name", "ref", "state", "subject", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @issue = Issue.new(params[:issue])

    respond_to do |format|
      if @issue.save